"""
Найдите сумму цифр трехзначного числа.

*Пример:*

123 -> 6 (1 + 2 + 3)
100 -> 1 (1 + 0 + 0) |

"""

num = input("Введите ваше число: ")

print(int(num[0]) + int(num[1]) + int(num[2]))
