"""
Дан список чисел. Определите, сколько в нем встречается различных чисел.
list_1 = [1, 2, 3, 1, 1, 5, 10, 20, 20, 30]
"""

list_1 = [1, 2, 3, 1, 1, 5, 10, 20, 20, 30]
list_2 = []
for i in list_1:
    if i not in list_2:
        list_2.append(i)
print(len(list_2))
